## [ 접근자 Accessor ]
- Series / DataFrame 의 데이터가 날짜시간(datetime), 문자열(object), 범주형(category),등의 경우 데이터 타입과 관련된 전용의 함수들 사용할 수 있도록 해주는 속성
- Series.str.문자열처리관련함수명()
- Seires.dt.날짜시간처리관련속성명
- Series.cat.범주형처리관련함수명()

(1) 모듈 로딩<hr>

In [27]:
import pandas as pd

(2) 데이터 준비 <hr>

In [28]:
datas = {"name":['홍 길동','이 나영','마 징가','베 토벤']   ## key값이 컬럼명
         ,'age':[10,21,73,89],
         'reg_date': ['2010/1/23','2020/4/23','2000/7/18','2017/12/3']}

datas2 = ["name",'age', 'reg_date'], ['홍 길동','이 나영','마 징가','베 토벤'],[10,21,73,89], ['2010/1/23','2020/4/23','2000/7/18','2017/12/3']

(3) 데이터 저장 <hr>

In [29]:
# Dict ==> DataFrame
df1 = pd.DataFrame(datas)
df1

   name  age   reg_date
0  홍 길동   10  2010/1/23
1  이 나영   21  2020/4/23
2  마 징가   73  2000/7/18
3  베 토벤   89  2017/12/3

In [30]:
# List ==> DataFrame
df2=pd.DataFrame(datas2)
df2

           0          1          2          3
0       name        age   reg_date       None
1       홍 길동       이 나영       마 징가       베 토벤
2         10         21         73         89
3  2010/1/23  2020/4/23  2000/7/18  2017/12/3

(4) 데이터 정보 확인 <hr>

In [31]:
# 데이터의 전체 기본 정보 -> info()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      4 non-null      object
 1   age       4 non-null      int64
 2   reg_date  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

(5) 데이터 전처리<hr>

- (5-1) 행 <-> 열 치환

In [32]:
df1 = df1.T
df1 = df1.transpose()

(5-2) 실제 데이터와 타입 확인 후 형변환

In [33]:
df1.head()

   name age   reg_date
0  홍 길동  10  2010/1/23
1  이 나영  21  2020/4/23
2  마 징가  73  2000/7/18
3  베 토벤  89  2017/12/3

In [34]:
# 1번 컬럼 : object => int
df1['age'] = df1['age'].astype('uint8')

In [35]:
# 2번 컬럼 : object => datetime64[ns]
df1['reg_date'] = df1['reg_date'].astype('datetime64[ns]')

In [36]:
df1.dtypes

name                object
age                  uint8
reg_date    datetime64[ns]
dtype: object

(5-3) 0번 컬럼의 이름을 성과 이름으로 분리

In [37]:
# 0번 컬럼만 추출
nameSR = df1['name']
nameSR, nameSR[1]   # nameSR[1] type : str

(0    홍 길동
 1    이 나영
 2    마 징가
 3    베 토벤
 Name: name, dtype: object,
 '이 나영')

In [38]:
# "이 나영" 데이터를 추출 => 성과 이름으로 분리
# nameSR[1].split()

In [39]:
# for idx in range(nameSR.shape[0]):
#     nameSR[idx] = nameSR[idx].split()

# nameSR

In [40]:
namesDF = nameSR.str.split(expand=True)

(5-4) 두개의 DataFrame을 컬럼 방향으로 연결

In [41]:
df1 = pd.concat([df1,namesDF], axis = 1, ignore_index = True )  # 기본값은 axis = 0 -> 밑으로 연결됨

(5-5) 2번 컬럼에서 년,월,일 분리

In [42]:
yearSR = df1[2].dt.year

In [43]:
monthSR = df1[2].dt.month

In [44]:
daySR = df1[2].dt.day

In [46]:
pd.concat([df1,yearSR,monthSR, daySR], axis=1, ignore_index=True)

      0   1          2  3   4     5   6   7
0  홍 길동  10 2010-01-23  홍  길동  2010   1  23
1  이 나영  21 2020-04-23  이  나영  2020   4  23
2  마 징가  73 2000-07-18  마  징가  2000   7  18
3  베 토벤  89 2017-12-03  베  토벤  2017  12   3

(5-6) 현재 DataFrame을 파일로 저장하기   =>  DF.to_확장자('파일경로+파일명)

In [51]:
# CSV ==> 데이터와 데이터의 구분자
filename = './backup.csv'   # . : 현재위치   
#          ='backup.csv' 
df1.to_csv(filename, sep = ' ', index=False, header=False)  # index : 행 인덱스 포함 여부 # header : 열 인덱스 포함 여부  ==> 실제 데이터만 들어옴

In [53]:
pd.read_csv(filename, header=None, sep = " ")

      0   1           2  3   4
0  홍 길동  10  2010-01-23  홍  길동
1  이 나영  21  2020-04-23  이  나영
2  마 징가  73  2000-07-18  마  징가
3  베 토벤  89  2017-12-03  베  토벤